#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=e2584cbb-77a2-443d-b6c7-e3436ddf47eb-00685ac7-79c2-49be-91b5-9996f272ffab-4f2ea9b9-9fb0-4dd3-9011-de40855fb0f3]
azuread_application.ACR-access-app: Refreshing state... [id=2e293956-b8a5-4ff5-92e6-2b3c355cbaec]
azuread_application_password.ACR-access-app-password: Refreshing state... [id=2e293956-b8a5-4ff5-92e6-2b3c355cbaec/password/cb7bc7f7-d121-492a-a26a-a06ba3c88b3a]
azurerm_resource_group.rg-projectf-dev-001: Refreshing state... [id=/subscriptions/039c5e5c-dcac-426f-9174-a04e1c39f8a3/resourceGroups/rg-projectf-dev-001]
azurerm_key_vault_secret.ACR-access-app-password-akv-secret: Refreshing state... [id=https://akv-projectf-dev-001.vault.azure.net/secrets/GHActionsAcrAccessSecret/29bd92b722534807a1b4b5db39423d82]
data.azurerm_client_config.current: Reading...
azurerm_key_vault.akv-terraform-secrets: Refreshing state... [id=/subscriptions/039c5e5c-dcac-426f-9174-a04e1c39f8a3/resourceGroups/rg-projectf-terraform-dev-001/providers/Microsoft.KeyVault/vaults/akv-projectf-dev-001]
data.azurerm_client_config.current: Read complete after 0s [id=2022-07-29 14:40:28.766352657 +0000 UTC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_key_vault.akv-terraform-secrets will be destroyed
  # (because azurerm_key_vault.akv-terraform-secrets is not in configuration)
  - resource "azurerm_key_vault" "akv-terraform-secrets" {
      - access_policy                   = [
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "4f2ea9b9-9fb0-4dd3-9011-de40855fb0f3"
              - secret_permissions      = [
                  - "Get",
                  - "Set",
                ]
              - storage_permissions     = []
              - tenant_id               = "e2584cbb-77a2-443d-b6c7-e3436ddf47eb"
            },
        ] -> null
      - enable_rbac_authorization       = false -> null
      - enabled_for_deployment          = false -> null
      - enabled_for_disk_encryption     = true -> null
      - enabled_for_template_deployment = false -> null
      - id                              = "/subscriptions/039c5e5c-dcac-426f-9174-a04e1c39f8a3/resourceGroups/rg-projectf-terraform-dev-001/providers/Microsoft.KeyVault/vaults/akv-projectf-dev-001" -> null
      - location                        = "northeurope" -> null
      - name                            = "akv-projectf-dev-001" -> null
      - purge_protection_enabled        = false -> null
      - resource_group_name             = "rg-projectf-terraform-dev-001" -> null
      - sku_name                        = "standard" -> null
      - soft_delete_retention_days      = 7 -> null
      - tags                            = {
          - "CreatedBy" = "4f2ea9b9-9fb0-4dd3-9011-de40855fb0f3"
        } -> null
      - tenant_id                       = "e2584cbb-77a2-443d-b6c7-e3436ddf47eb" -> null
      - vault_uri                       = "https://akv-projectf-dev-001.vault.azure.net/" -> null

      - network_acls {
          - bypass                     = "AzureServices" -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }
    }

  # azurerm_key_vault_secret.ACR-access-app-password-akv-secret will be destroyed
  # (because azurerm_key_vault_secret.ACR-access-app-password-akv-secret is not in configuration)
  - resource "azurerm_key_vault_secret" "ACR-access-app-password-akv-secret" {
      - content_type   = "" -> null
      - id             = "https://akv-projectf-dev-001.vault.azure.net/secrets/GHActionsAcrAccessSecret/29bd92b722534807a1b4b5db39423d82" -> null
      - key_vault_id   = "/subscriptions/039c5e5c-dcac-426f-9174-a04e1c39f8a3/resourceGroups/rg-projectf-terraform-dev-001/providers/Microsoft.KeyVault/vaults/akv-projectf-dev-001" -> null
      - name           = "GHActionsAcrAccessSecret" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "29bd92b722534807a1b4b5db39423d82" -> null
      - versionless_id = "https://akv-projectf-dev-001.vault.azure.net/secrets/GHActionsAcrAccessSecret" -> null
    }

  # github_actions_secret.example_secret will be created
  + resource "github_actions_secret" "example_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "Project-F"
      + secret_name     = "AcrAccessSecret"
      + updated_at      = (known after apply)
    }

Plan: 1 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  - service-principal-passoword-output = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Retoxx-dev, Action: `pull_request`*